In [2]:
print("foi mal!")

foi mal!

In [4]:
import pandas as pd
df = pd.DataFrame({
    'sp' : ['MM1', 'MM1', 'MM1', 'MM2', 'MM2', 'MM2', 'MM4', 'MM4', 'MM4'],
    'mt' : ['S1', 'S1', 'S3', 'S3', 'S4', 'S4', 'S2', 'S2', 'S2'],
    'val' : ['a', 'n', 'cb', 'mk', 'bg', 'dgb', 'rd', 'cb', 'uyi'],
    'count' : [3,2,5,8,10,1,2,2,7]
    })
df

    sp  mt  val  count
0  MM1  S1    a      3
1  MM1  S1    n      2
2  MM1  S3   cb      5
3  MM2  S3   mk      8
4  MM2  S4   bg     10
5  MM2  S4  dgb      1
6  MM4  S2   rd      2
7  MM4  S2   cb      2
8  MM4  S2  uyi      7

In [6]:
df_grouped = df.groupby(['sp', 'mt']).agg({'count':'max'})
df_grouped

        count
sp  mt
MM1 S1      3
    S3      5
MM2 S3      8
    S4     10
MM4 S2      7

In [7]:
df_grouped = df_grouped.reset_index()
df_grouped

    sp  mt  count
0  MM1  S1      3
1  MM1  S3      5
2  MM2  S3      8
3  MM2  S4     10
4  MM4  S2      7

In [ ]:
df_grouped = df_grouped.rename(columns={'count':'count_max'})

In [ ]:
df = pd.merge(df, df_grouped, how='left', on=['sp', 'mt'])

In [ ]:
df = df[df['count'] == df['count_max']]